---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IFCExportOptions
source: html/b90adabd-0502-fb8f-3a0d-bfa412393f61.htm
---
# IFCExportOptions Members

Default constructor. Initializes FileVersion to Default.
 WallAndColumnSplitting and ExportBaseQuantities are set to false.
 FamilyMappingFile is set to empty.